name: "vit_hf"
backend: "python"
max_batch_size: 8

input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [-1, -1, 3]
  }
]
output [
  {
    name: "last_hidden_state"
    data_type: TYPE_FP32
    dims: [-1, -1]
  }
]

dynamic_batching {
    preferred_batch_size: [ 4, 8 ]
}

instance_group [
  {
    kind: KIND_GPU
  }
]
